// // - Користувач вводить або має два числа.
// //     Потрібно знайти та вивести максимальне число з тих двох .
// //     Також потрібно врахувати коли введені рівні числа.
//
// let a =+prompt('введіть перше число');
// let b =+prompt('введіть друге число');
// if(a>b){
//     console.log(a)
// } else if(a===b){
//     console.log('числа еквівалентні')
// } else {
//     console.log(b)
// }


// // - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// // Користувач вводить номер квартири просто в змінні або через prompt('') .
// //     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
//
// let number =prompt('введіть номер квартири');
// if(number >=1 && number <=20){
//     console.log('Ваша квартира в першому підїзді')
// } else if(number >=21 && number <=48){
//     console.log('Ваша квартира в другому підїзді')
// } else if (number >=49 && number <=90){
//     console.log('Ваша квартира в третьому підїзді')
// }else {
//     console.log('такої квартири не існує')
// }

// // - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
//
// let number =10;
// (+prompt('якесь число') ===10) ? console.log('Вірно') : console.log('невірно')


// // - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
// //     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
// //     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
//
// let temper = 15;
// if (temper >= 10 && temper <=22){
//     console.log('йдемо на заняття')
// } else{
//     console.log('сидимо вдома')
// }


// // - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
// //     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .
//
// let number = +prompt('Ваш приз від 1 до 5')
//  switch (number){
//      case 1 :
//          console.log('Ваш приз"автомобіль"')
//          break;
//      case 2 :
//          console.log('Ваш приз "телефон"')
//         break;
//      case 3:
//          console.log('Ваш приз "абонимент на 10 років"')
//          break;
//      case 4:
//          console.log('Ваш приз "МРТ всього тіла"')
//          break;
//      case 5 :
//          console.log('Ваш приз "МРТ всього тіла"')
//          break;
//  }
// if (number > 5   || number < 1){
//     console.log('число не коректне')
// }

