// // --створити масив з:
// //     - з 5 числових значень
// // - з 5 стічкових значень
// // - з 5 значень стрічкового, числового та булевого типу
// // - та вивести його в консоль
//
// let numbers = [5,6,4,7,3];
// let str = ['loshka','lopata', 'something', 'yet', 'enough'];
// let few = ['lol', false, 9, 1,true];
// console.log(str);
// console.log(numbers);
// console.log(few);

// // -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
// let arr =[];
// arr[0]=3;
// arr[1]=41;
// arr[2]=22;
// arr[3]=55;
// console.log(arr);

// // - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
//
// for(let i = 0; i<10; i++){
//     document.write(`<div>довільний текст</div>`)
// }


// // - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
//
// for(let i =0; i<10; i++){
//     document.write(`<div>dovilnuy text ${i}</div>`)
// }

// // - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
//
// let i =0
// while (i<20){
//     document.write(`<h1> довільний текст</h1>`)
//     i++
// }

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.




